EDT/УТ/src/InformationRegisters/КонтрольВремени/КонтрольВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтрольВремени</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОкончаниеСобытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияКонтроляВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРейсов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/КонтрольВремени/ManagerModule.bsl
Функция ВыполняетсяСобытиеМаршрутизации(Терминал) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(КонтрольВремени.ДатаРейсов) КАК ДатаРейсов,
	               |	КонтрольВремени.Терминал КАК Терминал
	               |ПОМЕСТИТЬ ДатаНачалаЗаданияМаршрутизации
	               |ИЗ
	               |	РегистрСведений.КонтрольВремени КАК КонтрольВремени
	               |ГДЕ
	               |	КонтрольВремени.Рейс = ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
	               |	И КонтрольВремени.ОкончаниеСобытия = ЛОЖЬ
	               |	И КонтрольВремени.Терминал = &Терминал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтрольВремени.Терминал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтрольВремени.ОкончаниеСобытия КАК ОкончаниеСобытия
	               |ИЗ
	               |	ДатаНачалаЗаданияМаршрутизации КАК ДатаНачалаЗаданияМаршрутизации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтрольВремени КАК КонтрольВремени
	               |		ПО ДатаНачалаЗаданияМаршрутизации.ДатаРейсов = КонтрольВремени.ДатаРейсов
	               |			И ДатаНачалаЗаданияМаршрутизации.Терминал = КонтрольВремени.Терминал
	               |ГДЕ
	               |	КонтрольВремени.Рейс = ЗНАЧЕНИЕ(Документ.Рейс.ПустаяСсылка)
	               |	И КонтрольВремени.ОкончаниеСобытия = ИСТИНА";
	Запрос.УстановитьПараметр("Терминал",Терминал);
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой()	
КонецФункции


//Асеев 25.12.2023 (Задача № 5193)>>>
Функция ПаузаОтФиксацииМаршрутизации(ТерминалДоставки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Терминал", ТерминалДоставки);
	Запрос.УстановитьПараметр("Период", ТекущаяДата() - 900);//15 мин = 15*60 = 900
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.КонтрольВремени КАК КонтрольВремени
	|ГДЕ
	|	КонтрольВремени.Период >= &Период
	|	И КонтрольВремени.Терминал = &Терминал
	|	И КонтрольВремени.Событие = ЗНАЧЕНИЕ(Справочник.СобытияКонтроляВремени.ПМФиксацияМаршрутизации)";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Сообщить("Запрещено проведение документов ранее, чем спустя 15 минут после окончания фиксации маршрутизации ПМ!");
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
//Асеев 25.12.2023 (Задача № 5193)<<<
